Repository: thak1996/portfolio_flutter
Catalog: lib/l10n/app_*.arb
Languages: pt

# sectionAbout
source: About
pt: Sobre

# heroTagline
source: Creating Digital Solutions with
pt: Criando Soluções Digitais com

# heroTaglineHighlight
source: Precision.
pt: Precisão.

# heroDescription
source: Mobile Developer focused on Flutter, building Android and iOS applications using Dart, Firebase, and Clean Architecture.
pt: Desenvolvedor Mobile com foco em Flutter, atuando na construção de aplicações Android e iOS com uso de Dart, Firebase e arquitetura limpa.

# heroCtaProjects
source: View Projects
pt: Ver Projetos

# heroCtaContact
source: Contact
pt: Contato

# experienceTitle
source: Experience
pt: Experiência

# expJob1Role
source: Full Stack Developer
pt: Desenvolvedor Full Stack

# expJob1Stack
source: Modernization & Infrastructure
pt: Modernização e Infraestrutura

# expJob1Period
source: Jul 2025 - Present
pt: jul de 2025 - até o momento

# expJob1Location
source: Remote
pt: Remoto

# expJob1Points
source: Complete interface overhaul (UI/UX) for modernization|Implementation of systems using PHP Laravel and Filament PHP|Configuration and deployment on VPS servers|Network infrastructure and DNS management|Corporate email service administration
pt: Reformulação completa de interface (UI/UX) visando a modernização e responsividade|Implementação e migração de sistema utilizando PHP Laravel e Filament PHP|Configuração e deploy de ambiente de produção em servidor VPS|Gestão de infraestrutura de rede e zonas DNS|Administração e migração de serviços de e-mail corporativo

# expJob1Skills
source: PHP Laravel|Filament PHP|VPS Server Administration|DNS & Domains|UI/UX Design
pt: PHP Laravel|Filament PHP|Administração de Servidores (VPS)|DNS & Domínios|UI/UX Design

# expJob2Role
source: Software Developer
pt: Desenvolvedor de Software

# expJob2Stack
source: Automation & Integration
pt: Automação & Integração

# expJob2Company
source: Freelance
pt: Autônomo

# expJob2Period
source: Sep 2025 - Dec 2025
pt: set de 2025 - dez de 2025

# expJob2Location
source: Remote
pt: Remoto

# expJob2Points
source: Development of integrations for web forms|Creation of automations using Google Apps Script|System integration via Google Sheets
pt: Desenvolvimento de integrações para captura de formulários web|Criação de automações utilizando Google Apps Script|Integração entre sistemas via Google Sheets

# expJob2Skills
source: Google Apps Script|WebHooks|Google Sheets|API Integrations|JavaScript|JSON|Process Automation
pt: Google Apps Script|WebHooks|Google Sheets|Integrações de APIs|JavaScript|JSON|Automação de Processos

# expJob3Role
source: Flutter Mobile Developer
pt: Desenvolvedor Mobile Flutter

# expJob3Stack
source: Project-based
pt: Projeto Pontual

# expJob3Company
source: Freelance
pt: Autônomo

# expJob3Period
source: May 2025
pt: Mai de 2025

# expJob3Location
source: Remote
pt: Remoto

# expJob3Points
source: Clean Architecture implementation for scalability|Data sync between Firebase and ObjectBox
pt: Implementação de Clean Architecture visando escalabilidade|Sincronização de dados entre Firebase e ObjectBox

# expJob4Role
source: Software Developer
pt: Desenvolvedor de Software

# expJob4Period
source: Nov 2023 - Nov 2024
pt: nov de 2023 - nov de 2024

# expJob4Location
source: Remote
pt: Remoto

# expJob4Points
source: Development of mobile and web applications using Flutter|Creation of REST APIs with PHP Laravel for integration with mobile apps|Efficient integration between frontend and backend|Development of administrative panels for data management|Optimization of applications focusing on performance and usability
pt: Desenvolvimento de aplicações mobile e web utilizando Flutter|Criação de APIs REST com PHP Laravel para integração com apps mobile|Integração eficiente entre frontend e backend|Desenvolvimento de painéis administrativos para gestão de dados|Otimização de aplicações com foco em performance e usabilidade

# educationTitle
source: Education
pt: Educação

# eduDegree1
source: Analysis and Systems Development
pt: Análise e Desenvolvimento de Sistemas

# eduInst1
source: Uninter International University
pt: Uninter Centro Universitário Internacional

# eduLocation1
source: São Paulo, Brazil
pt: São Paulo, Brasil

# eduYear1
source: Jan 2026 - Feb 2027
pt: Jan de 2026 - Fev de 2027

# eduDegree2
source: Mobile Development
pt: Desenvolvimento Mobile

# eduLocation2
source: São Paulo, Brazil
pt: São Paulo, Brasil

# eduYear2
source: Jul 2023 - Nov 2025
pt: Jul de 2023 - Nov de 2025

# eduLocation3
source: São Paulo, Brazil
pt: São Paulo, Brasil

# eduYear3
source: Jul 2022 - Sep 2022
pt: Jul de 2022 - Set de 2022

# skillsTitle
source: Skills
pt: Habilidades

# skillSoftArchTitle
source: Clean Architecture
pt: Arquitetura Limpa

# skillSoftArchDesc
source: Focus on decoupled, testable, and scalable code using Clean Architecture.
pt: Foco em código desacoplado, testável e escalável utilizando Clean Architecture.

# skillSoftProbTitle
source: Problem Solving
pt: Resolução de Problemas

# skillSoftProbDesc
source: Ability to analyze technical issues and implement efficient automations.
pt: Habilidade em analisar problemas técnicos e implementar automações eficientes.

# skillSoftFullTitle
source: Full Stack Mindset
pt: Mentalidade Full Stack

# skillSoftFullDesc
source: Holistic project view, from VPS infrastructure to mobile interface.
pt: Visão holística do projeto, desde a infraestrutura VPS até a interface mobile.

# strategicAreas
source: REST API Integration|State Management (Cubit/Bloc)|CI/CD & Automated Deploy|Performance Optimization|Network Infrastructure Management
pt: Integração de APIs REST|Gerenciamento de Estado (Cubit/Bloc)|CI/CD & Deploy Automatizado|Otimização de Performance|Gestão de Infraestrutura de Rede

# projectsTitle
source: Projects
pt: Projetos

# proj1Desc
source: Logistics and relocation management system with administrative panel and control dashboards.
pt: Sistema de gerenciamento de mudanças e logística com painel administrativo e dashboards de controle.

# proj1Technologies
source: PHP Laravel|VPS|Domains|UI/UX
pt: PHP Laravel|VPS|Domínios|UI/UX

# proj2Desc
source: Mobile application for institutions and orphanages, focused on social connection.
pt: Aplicação mobile para instituições e orfanatos, focada em conexão social.

# proj3Desc
source: HR Manager built with Laravel 10, Docker, and MySQL.
pt: Gerenciador de RH construído com Laravel 10, Docker e MySQL.

# contactTitle
source: Contact
pt: Contato

# contactSubtitle
source: Let's discuss your next project
pt: Vamos discutir seu próximo projeto

# contactHeading
source: Get in Touch
pt: Entre em Contato

# contactDesc
source: I am available for freelance work or full-time positions. Feel free to get in touch.
pt: Estou disponível para trabalhos freelancer ou posições de tempo integral. Sinta-se livre para entrar em contato.

# contactLabelName
source: Your Name
pt: Seu Nome

# contactHintName
source: Enter your full name
pt: Digite seu nome completo

# contactLabelEmail
source: Your Email
pt: Seu Email

# contactHintEmail
source: Enter your email
pt: Digite seu email

# contactLabelSubject
source: Subject
pt: Assunto

# contactHintSubject
source: Enter the subject
pt: Digite o assunto

# contactLabelPhone
source: Phone
pt: Telefone

# contactHintPhone
source: Enter your phone number
pt: Digite seu telefone

# contactLabelMessage
source: Message
pt: Mensagem

# contactHintMessage
source: Tell me about your project...
pt: Conte-me sobre o seu projeto...

# contactBtnSubmit
source: Send Message
pt: Enviar Mensagem

# contactInfoEmailTitle
source: Send an Email
pt: Envie um Email

# contactInfoLocationTitle
source: Location
pt: Localização

# contactInfoLocationValue
source: São Paulo, SP - Brazil
pt: São Paulo, SP - Brasil

# contactInfoHoursTitle
source: Business Hours
pt: Horário de Funcionamento

# contactInfoHoursValue
source: Mon - Fri: 9:00 AM - 6:00 PM
pt: Seg - Sex: 9:00 - 18:00
